app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def add
    @events = Event.all

INSERT INTO "events" ("name", "start_time", "place", "check", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test6"], ["start_time", "2019-12-09 07:59:00"], ["place", ""], ["check", 0], ["created_at", "2019-12-09 08:00:04.027037"], ["updated_at", "2019-12-09 08:00:04.027037"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "start_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_time", "2019-12-09 04:08:00"], ["updated_at", "2019-12-09 06:55:15.327549"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)